ARM-Mbed/STM32F469_Discover_kit/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "stm32f4xx_ll_adc.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SAI1_FSA_Pin LL_GPIO_PIN_4
#define SAI1_FSA_GPIO_Port GPIOE
#define SPKR_HP_Pin LL_GPIO_PIN_3
#define SPKR_HP_GPIO_Port GPIOE
#define AUDIO_RST_Pin LL_GPIO_PIN_2
#define AUDIO_RST_GPIO_Port GPIOE
#define ARDUINO_USART6_TX_Pin LL_GPIO_PIN_14
#define ARDUINO_USART6_TX_GPIO_Port GPIOG
#define FMC_NBL1_Pin LL_GPIO_PIN_1
#define FMC_NBL1_GPIO_Port GPIOE
#define FMC_NBL0_Pin LL_GPIO_PIN_0
#define FMC_NBL0_GPIO_Port GPIOE
#define I2C1_SCL_Pin LL_GPIO_PIN_8
#define I2C1_SCL_GPIO_Port GPIOB
#define I2S3_CK_Pin LL_GPIO_PIN_3
#define I2S3_CK_GPIO_Port GPIOB
#define uSD_CLK_Pin LL_GPIO_PIN_12
#define uSD_CLK_GPIO_Port GPIOC
#define SWCLK_Pin LL_GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define SWDIO_Pin LL_GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SAI1_SCKA_Pin LL_GPIO_PIN_5
#define SAI1_SCKA_GPIO_Port GPIOE
#define I2C1_SDA_Pin LL_GPIO_PIN_9
#define I2C1_SDA_GPIO_Port GPIOB
#define OTG_FS1_OverCurrent_Pin LL_GPIO_PIN_7
#define OTG_FS1_OverCurrent_GPIO_Port GPIOB
#define QSPI_BK1_NCS_Pin LL_GPIO_PIN_6
#define QSPI_BK1_NCS_GPIO_Port GPIOB
#define SDNCAS_Pin LL_GPIO_PIN_15
#define SDNCAS_GPIO_Port GPIOG
#define MIC_DATA_Pin LL_GPIO_PIN_6
#define MIC_DATA_GPIO_Port GPIOD
#define D2_Pin LL_GPIO_PIN_0
#define D2_GPIO_Port GPIOD
#define uSD_D3_Pin LL_GPIO_PIN_11
#define uSD_D3_GPIO_Port GPIOC
#define uSD_D2_Pin LL_GPIO_PIN_10
#define uSD_D2_GPIO_Port GPIOC
#define USB_FS1_P_Pin LL_GPIO_PIN_12
#define USB_FS1_P_GPIO_Port GPIOA
#define FMC_NBL2_Pin LL_GPIO_PIN_4
#define FMC_NBL2_GPIO_Port GPIOI
#define LED_Red_Pin LL_GPIO_PIN_5
#define LED_Red_GPIO_Port GPIOD
#define D3_Pin LL_GPIO_PIN_1
#define D3_GPIO_Port GPIOD
#define D27_Pin LL_GPIO_PIN_3
#define D27_GPIO_Port GPIOI
#define D26_Pin LL_GPIO_PIN_2
#define D26_GPIO_Port GPIOI
#define USB_FS1_N_Pin LL_GPIO_PIN_11
#define USB_FS1_N_GPIO_Port GPIOA
#define A0_Pin LL_GPIO_PIN_0
#define A0_GPIO_Port GPIOF
#define FMC_NBL3_Pin LL_GPIO_PIN_5
#define FMC_NBL3_GPIO_Port GPIOI
#define D29_Pin LL_GPIO_PIN_7
#define D29_GPIO_Port GPIOI
#define D31_Pin LL_GPIO_PIN_10
#define D31_GPIO_Port GPIOI
#define D28_Pin LL_GPIO_PIN_6
#define D28_GPIO_Port GPIOI
#define LED_Blue_Pin LL_GPIO_PIN_3
#define LED_Blue_GPIO_Port GPIOK
#define USART6_RX_Pin LL_GPIO_PIN_9
#define USART6_RX_GPIO_Port GPIOG
#define LED_Orange_Pin LL_GPIO_PIN_4
#define LED_Orange_GPIO_Port GPIOD
#define uSD_CMD_Pin LL_GPIO_PIN_2
#define uSD_CMD_GPIO_Port GPIOD
#define D23_Pin LL_GPIO_PIN_15
#define D23_GPIO_Port GPIOH
#define D25_Pin LL_GPIO_PIN_1
#define D25_GPIO_Port GPIOI
#define USB_FS1_ID_Pin LL_GPIO_PIN_10
#define USB_FS1_ID_GPIO_Port GPIOA
#define A1_Pin LL_GPIO_PIN_1
#define A1_GPIO_Port GPIOF
#define D30_Pin LL_GPIO_PIN_9
#define D30_GPIO_Port GPIOI
#define D21_Pin LL_GPIO_PIN_13
#define D21_GPIO_Port GPIOH
#define D22_Pin LL_GPIO_PIN_14
#define D22_GPIO_Port GPIOH
#define D24_Pin LL_GPIO_PIN_0
#define D24_GPIO_Port GPIOI
#define VBUS_FS1_Pin LL_GPIO_PIN_9
#define VBUS_FS1_GPIO_Port GPIOA
#define uSD_D1_Pin LL_GPIO_PIN_9
#define uSD_D1_GPIO_Port GPIOC
#define A2_Pin LL_GPIO_PIN_2
#define A2_GPIO_Port GPIOF
#define uSD_D0_Pin LL_GPIO_PIN_8
#define uSD_D0_GPIO_Port GPIOC
#define A3_Pin LL_GPIO_PIN_3
#define A3_GPIO_Port GPIOF
#define I2C2_SCL_Pin LL_GPIO_PIN_4
#define I2C2_SCL_GPIO_Port GPIOH
#define SDCLK_Pin LL_GPIO_PIN_8
#define SDCLK_GPIO_Port GPIOG
#define A4_Pin LL_GPIO_PIN_4
#define A4_GPIO_Port GPIOF
#define I2C2_SDA_Pin LL_GPIO_PIN_5
#define I2C2_SDA_GPIO_Port GPIOH
#define SDNE0_Pin LL_GPIO_PIN_3
#define SDNE0_GPIO_Port GPIOH
#define SAI1_MCLKA_Pin LL_GPIO_PIN_7
#define SAI1_MCLKA_GPIO_Port GPIOG
#define LED_Green_Pin LL_GPIO_PIN_6
#define LED_Green_GPIO_Port GPIOG
#define QSPI_BK1_IO2_Pin LL_GPIO_PIN_7
#define QSPI_BK1_IO2_GPIO_Port GPIOF
#define QSPI_BK1_IO3_Pin LL_GPIO_PIN_6
#define QSPI_BK1_IO3_GPIO_Port GPIOF
#define A5_Pin LL_GPIO_PIN_5
#define A5_GPIO_Port GPIOF
#define SDCKE0_Pin LL_GPIO_PIN_2
#define SDCKE0_GPIO_Port GPIOH
#define D1_Pin LL_GPIO_PIN_15
#define D1_GPIO_Port GPIOD
#define D15_Pin LL_GPIO_PIN_10
#define D15_GPIO_Port GPIOD
#define QSPI_CLK_Pin LL_GPIO_PIN_10
#define QSPI_CLK_GPIO_Port GPIOF
#define QSPI_BK1_IO1_Pin LL_GPIO_PIN_9
#define QSPI_BK1_IO1_GPIO_Port GPIOF
#define QSPI_BK1_IO0_Pin LL_GPIO_PIN_8
#define QSPI_BK1_IO0_GPIO_Port GPIOF
#define D0_Pin LL_GPIO_PIN_14
#define D0_GPIO_Port GPIOD
#define D14_Pin LL_GPIO_PIN_9
#define D14_GPIO_Port GPIOD
#define D13_Pin LL_GPIO_PIN_8
#define D13_GPIO_Port GPIOD
#define SDNWE_Pin LL_GPIO_PIN_0
#define SDNWE_GPIO_Port GPIOC
#define OTG_FS1_PowerSwitchOn_Pin LL_GPIO_PIN_2
#define OTG_FS1_PowerSwitchOn_GPIO_Port GPIOB
#define A6_Pin LL_GPIO_PIN_12
#define A6_GPIO_Port GPIOF
#define A11_Pin LL_GPIO_PIN_1
#define A11_GPIO_Port GPIOG
#define A9_Pin LL_GPIO_PIN_15
#define A9_GPIO_Port GPIOF
#define MIC_CK_Pin LL_GPIO_PIN_13
#define MIC_CK_GPIO_Port GPIOD
#define uSD_Detect_Pin LL_GPIO_PIN_2
#define uSD_Detect_GPIO_Port GPIOG
#define LCD_INT_Pin LL_GPIO_PIN_5
#define LCD_INT_GPIO_Port GPIOJ
#define D20_Pin LL_GPIO_PIN_12
#define D20_GPIO_Port GPIOH
#define WAKEUP_Pin LL_GPIO_PIN_0
#define WAKEUP_GPIO_Port GPIOA
#define A7_Pin LL_GPIO_PIN_13
#define A7_GPIO_Port GPIOF
#define A10_Pin LL_GPIO_PIN_0
#define A10_GPIO_Port GPIOG
#define D5_Pin LL_GPIO_PIN_8
#define D5_GPIO_Port GPIOE
#define D17_Pin LL_GPIO_PIN_9
#define D17_GPIO_Port GPIOH
#define D19_Pin LL_GPIO_PIN_11
#define D19_GPIO_Port GPIOH
#define A8_Pin LL_GPIO_PIN_14
#define A8_GPIO_Port GPIOF
#define DSI_TE_Pin LL_GPIO_PIN_2
#define DSI_TE_GPIO_Port GPIOJ
#define SDNMT48LC4M32B2B5_6A_RAS_RAS___Pin LL_GPIO_PIN_11
#define SDNMT48LC4M32B2B5_6A_RAS_RAS___GPIO_Port GPIOF
#define D6_Pin LL_GPIO_PIN_9
#define D6_GPIO_Port GPIOE
#define D8_Pin LL_GPIO_PIN_11
#define D8_GPIO_Port GPIOE
#define D11_Pin LL_GPIO_PIN_14
#define D11_GPIO_Port GPIOE
#define STLK_RX_Pin LL_GPIO_PIN_10
#define STLK_RX_GPIO_Port GPIOB
#define D16_Pin LL_GPIO_PIN_8
#define D16_GPIO_Port GPIOH
#define D18_Pin LL_GPIO_PIN_10
#define D18_GPIO_Port GPIOH
#define LCD_BL_CTRL_Pin LL_GPIO_PIN_3
#define LCD_BL_CTRL_GPIO_Port GPIOA
#define EXT_RESET_Pin LL_GPIO_PIN_0
#define EXT_RESET_GPIO_Port GPIOB
#define D4_Pin LL_GPIO_PIN_7
#define D4_GPIO_Port GPIOE
#define D7_Pin LL_GPIO_PIN_10
#define D7_GPIO_Port GPIOE
#define D9_Pin LL_GPIO_PIN_12
#define D9_GPIO_Port GPIOE
#define D12_Pin LL_GPIO_PIN_15
#define D12_GPIO_Port GPIOE
#define D10_Pin LL_GPIO_PIN_13
#define D10_GPIO_Port GPIOE
#define STLK_TX_Pin LL_GPIO_PIN_11
#define STLK_TX_GPIO_Port GPIOB
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
